import time
print("welcome to FLI - Fake Linux Installer")
print("available packages: firefox, steam, fastfetch, cmatrix, cava.")
otvet = input("user@hostname:~$")
if otvet == "firefox":
    print("""проверка зависимостей...
проверка конфликтов...""")
    time.sleep(3)
    print("""Пакеты (1) firefox-0.0.0.0

Размер загрузки:   0,08 MiB
Размер установки:  0,34 MiB""")
time.sleep(4)
otv = input("Приступить к установке? [Y/n]")
if otv == "y":
    print("""
:: Получение пакетов..x.
 firefox-0.0.0.0-any       000mb   163 KiB/s 00:01 [######################] 100%
(1/1) проверка ключей в брелоке                        [######################] 100%
(1/1) проверка целостности пакета                      [######################] 100%
(1/1) загрузка файлов пакетов                          [######################] 100%
(1/1) проверка конфликтов файлов                       [######################] 100%
(1/1) проверка доступного места                        [######################] 100%
:: Обработка изменений пакета...
(1/1) установка firefox                                [######################] 100%
:: Запуск post-transaction hooks...
(1/2) Arming ConditionNeedsUpdate...
(2/2) Updating the desktop file MIME type cache...""")
elif otv == "n":
    print("stop")
elif otvet == "steam":
      print("""проверка зависимостей...
проверка конфликтов...""")
time.sleep(3)
print("""Пакеты (1) steam-0.0.0.0

Размер загрузки:   0,08 MiB
Размер установки:  0,34 MiB""")
time.sleep(4)
otv = input("Приступить к установке? [Y/n]")
if otv == "y":
    print("""
:: Получение пакетов..x.
 steam -0.0.0.0-any       000mb   163 KiB/s 00:01 [######################] 100%
(1/1) проверка ключей в брелоке                        [######################] 100%
(1/1) проверка целостности пакета                      [######################] 100%
(1/1) загрузка файлов пакетов                          [######################] 100%
(1/1) проверка конфликтов файлов                       [######################] 100%
(1/1) проверка доступного места                        [######################] 100%
:: Обработка изменений пакета...
(1/1) установка steam                                  [######################] 100%
:: Запуск post-transaction hooks...
(1/2) Arming ConditionNeedsUpdate...
(2/2) Updating the desktop file MIME type cache...""")

